---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.Thumbnail
source: html/f07618f3-a9df-7520-3c18-d5dda40d692b.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.Thumbnail Property

The property labeled "Thumbnail" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string Thumbnail { get; }
```

## Remarks
This property is a "AssetPropertyList" of type "AssetPropertyString".